# Task 4.9 - Part 1

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Import data
path = r'C:\Users\fearn\Documents\lydia loser\Career Foundry\Python\Data'
df_customers = pd.read_csv(os.path.join(path, 'customers.csv'))

## Data Wrangling

#### Renaming Columns

In [4]:
# Assess the columns and whether things need to be changed or removed
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Observation: Surname column needs an 'e' on the end. STATE column can be changed from all caps. n_dependants is a bit confusing so change to num_of_dependants.

In [5]:
# Renaming columns
df_customers.rename(columns = {'Surnam' : 'Surname'}, inplace = True)
df_customers.rename(columns = {'STATE' : 'State'}, inplace = True)
df_customers.rename(columns = {'n_dependants' : 'num_of_dependants'}, inplace = True)

In [7]:
# Check
df_customers.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,num_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### Changing Datatypes

In [8]:
# Assess the datatypes
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int64
 1   First Name         194950 non-null  object
 2   Surname            206209 non-null  object
 3   Gender             206209 non-null  object
 4   State              206209 non-null  object
 5   Age                206209 non-null  int64
 6   date_joined        206209 non-null  object
 7   num_of_dependants  206209 non-null  int64
 8   fam_status         206209 non-null  object
 9   income             206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

Observation: user_id can be changed to str. Age and number of dependants can be changed to int8 for memory. Income changed to int32 for memory.

In [9]:
# Change datatypes
df_customers['user_id'] = df_customers['user_id'].astype('str')
df_customers['Age'] = df_customers['Age'].astype('int8')
df_customers['num_of_dependants'] = df_customers['num_of_dependants'].astype('int8')
df_customers['income'] = df_customers['income'].astype('int32')

In [10]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  object
 1   First Name         194950 non-null  object
 2   Surname            206209 non-null  object
 3   Gender             206209 non-null  object
 4   State              206209 non-null  object
 5   Age                206209 non-null  int8
 6   date_joined        206209 non-null  object
 7   num_of_dependants  206209 non-null  int8
 8   fam_status         206209 non-null  object
 9   income             206209 non-null  int32
dtypes: int32(1), int8(2), object(7)
memory usage: 12.2+ MB

## Data Quality and Consistency

#### Mixed-data types

In [11]:
# Finding and addressing mixed type data

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

First Name

Observation: First name is a mixed type column and needs to be changed. This should be a str datatype.

In [12]:
# Changing First Name datatype
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [13]:
# Check

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

#### Missing Values

In [14]:
# Find missing values
df_customers.isnull().sum()

user_id              0
First Name           0
Surname              0
Gender               0
State                0
Age                  0
date_joined          0
num_of_dependants    0
fam_status           0
income               0
dtype: int64

Observation: No missing values

#### Duplicates

In [15]:
df_dups = df_customers[df_customers.duplicated()]

In [16]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, State, Age, date_joined, num_of_dependants, fam_status, income]
Index: []

Observation: No duplicates

## Merging Data

In [17]:
# Import ord_prod data
ord_prod = pd.read_pickle(os.path.join(path, 'order_product_FINAL_no_outliers.pkl'))

In [18]:
# Merge Dataframes
df_merge = df_customers.merge(ord_prod, on = 'user_id', indicator = True)

## Export Data

In [19]:
df_merge.to_pickle(os.path.join(path, 'ord_prod_cust.pkl'))